{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FKawaiiPhysicsModuleEd",
			"Children": [
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FKawaiiPhysicsEditMode"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysicsMenuGroup"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysics",
			"Children": [
				{
					"Source": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CheckPresetDiffUnknownAnimBlueprint"
				},
				{
					"Source": {
						"Text": "Applies a preset data asset to this node."
					},
					"Translation": {
						"Text": "プリセットDataAssetをこのノードへ適用します"
					},
					"Key": "ApplyPresetMenuToolTip"
				},
				{
					"Source": {
						"Text": "Apply Preset..."
					},
					"Translation": {
						"Text": "プリセットを適用..."
					},
					"Key": "ApplyPresetMenuLabel"
				},
				{
					"Source": {
						"Text": "Check Preset Diff"
					},
					"Translation": {
						"Text": "プリセット差分を確認"
					},
					"Key": "CheckPresetDiffMenuLabel"
				},
				{
					"Source": {
						"Text": "Choose Kawaii Physics Preset"
					},
					"Translation": {
						"Text": "Kawaii Physics プリセットを選択"
					},
					"Key": "ApplyPresetDialogTitle"
				},
				{
					"Source": {
						"Text": "DebugVisualization"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ToggleDebugVisualizationButtonRow"
				},
				{
					"Source": {
						"Text": "Exported BoneConstraints Data Asset: {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportedBoneConstraintsDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Limits Data Asset: {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportedLimitsDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Preset Data Asset: {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportedPresetDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Preset Data Asset: {0}\nWarning: this node has no KawaiiPhysicsTag, so TargetTags is empty. Set a tag to include it in Reapply/Audit."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportedPresetDataAssetNoTag"
				},
				{
					"Source": {
						"Text": "Exported from Anim Blueprint: {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportedPresetDataAssetDescription"
				},
				{
					"Source": {
						"Text": "Failed to apply Preset: {0}"
					},
					"Translation": {
						"Text": "プリセットの適用に失敗しました: {0}"
					},
					"Key": "ApplyPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to load selected Kawaii Physics preset."
					},
					"Translation": {
						"Text": "選択した Kawaii Physics プリセットの読み込みに失敗しました"
					},
					"Key": "ApplyPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Kawaii Physics"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysicsContextMenuSection"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsTools"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics"
				},
				{
					"Source": {
						"Text": "No Procedural Wind external force on this node."
					},
					"Translation": {
						"Text": "Procedural Wind の外力がありません"
					},
					"Key": "NoProceduralWindExternalForce"
				},
				{
					"Source": {
						"Text": "No preset targets this node's tag."
					},
					"Translation": {
						"Text": "このノードのタグを対象とするプリセットがありません"
					},
					"Key": "NoPresetTargetsNodeTag"
				},
				{
					"Source": {
						"Text": "Open Created Asset"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenCreatedAsset"
				},
				{
					"Source": {
						"Text": "Open Preset"
					},
					"Translation": {
						"Text": "プリセットを開く"
					},
					"Key": "OpenAppliedPresetAsset"
				},
				{
					"Source": {
						"Text": "Open Preset"
					},
					"Translation": {
						"Text": "プリセットを開く"
					},
					"Key": "OpenPresetAsset"
				},
				{
					"Source": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Translation": {
						"Text": "Procedural Wind の波形プレビュータブを開く"
					},
					"Key": "OpenWindScopeToolTip"
				},
				{
					"Source": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Translation": {
						"Text": "Procedural Wind の波形プレビュータブを開きます"
					},
					"Key": "WindScopeMenuToolTip"
				},
				{
					"Source": {
						"Text": "Shows the diff between this node and its presets in a tab."
					},
					"Translation": {
						"Text": "このノードとプリセットの差分をタブで確認します"
					},
					"Key": "CheckPresetDiffMenuToolTip"
				},
				{
					"Source": {
						"Text": "Wind Scope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenWindScope"
				},
				{
					"Source": {
						"Text": "Wind Scope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WindScopeContextMenu"
				},
				{
					"Source": {
						"Text": "Wind Scope (Force [{0}])"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WindScopeContextMenuWithForceIndex"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CheckPresetDiffContextLabel"
				},
				{
					"Source": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimGraphNode_KawaiiPhysics_Title"
				},
				{
					"Source": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}\nTag:  {Tag} "
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimGraphNode_KawaiiPhysics_TitleWithTag"
				},
				{
					"Source": {
						"Text": "{ControllerDescription} - Root: {RootBoneName}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimGraphNode_KawaiiPhysics_ListTitle"
				},
				{
					"Source": {
						"Text": "{ControllerDescription} - Root: {RootBoneName} - Tag: {Tag}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimGraphNode_KawaiiPhysics_ListTitleWithTag"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsEditMode",
			"Children": [
				{
					"Source": {
						"Text": "Delete KawaiiPhysics Collision"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DeleteKawaiiCollision"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsEditorLibrary",
			"Children": [
				{
					"Source": {
						"Text": "Add Kawaii Physics Nodes"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AddKawaiiPhysicsNodes"
				},
				{
					"Source": {
						"Text": "Apply Kawaii Physics Preset"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetToGraphNode"
				},
				{
					"Source": {
						"Text": "Applying Kawaii Physics preset to AnimBlueprints..."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ReapplyPresetToProjectProgress"
				},
				{
					"Source": {
						"Text": "Export Kawaii Physics Graph Node To Preset"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportGraphNodeToPreset"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Property"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SetGraphNodePropertyByString"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Root Bone"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SetGraphNodeRootBoneName"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Tag"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SetGraphNodeTag"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Wildcard Property"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SetGraphNodeWildcardProperty"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsNodeAuditWindow",
			"Children": [
				{
					"Source": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffUnknownAnimBlueprint"
				},
				{
					"Source": {
						"Text": "Anim Blueprint のアセット名を表示します。ツールチップにフルパスを表示します / Shows the Anim Blueprint asset name. The tooltip shows the full path."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimBlueprintColumnToolTip"
				},
				{
					"Source": {
						"Text": "AnimBlueprint"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AnimBlueprintColumnLabel"
				},
				{
					"Source": {
						"Text": "Applied preset to {0} node(s)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectSucceeded"
				},
				{
					"Source": {
						"Text": "Apply preset '{0}' to the project?\n{1} node(s) currently differ from this preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectConfirm"
				},
				{
					"Source": {
						"Text": "Apply to Project 実行時にソース管理でパッケージをチェックアウトします / Checks out packages via source control when running Apply to Project."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CheckOutFilesToolTip"
				},
				{
					"Source": {
						"Text": "Apply to Project..."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectButton"
				},
				{
					"Source": {
						"Text": "Check out files"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CheckOutFilesLabel"
				},
				{
					"Source": {
						"Text": "DiffProperties"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DiffPropertiesColumnLabel"
				},
				{
					"Source": {
						"Text": "Export Kawaii Physics Audit"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportDialogTitle"
				},
				{
					"Source": {
						"Text": "Export..."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportButton"
				},
				{
					"Source": {
						"Text": "Exported Kawaii Physics audit results."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportSucceeded"
				},
				{
					"Source": {
						"Text": "Failed to export the Kawaii Physics audit results."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the matched preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the preset for Apply to Project."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the preset for Refresh."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RefreshPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenAnimBlueprintFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffResolveFailed"
				},
				{
					"Source": {
						"Text": "Graph"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GraphColumnLabel"
				},
				{
					"Source": {
						"Text": "Kawaii Node Audit"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NodeAuditTabLabel"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Node Audit"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NodeAuditMenuDisplayName"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics のノード監査タブを開きます / Opens the KawaiiPhysics node audit tab."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NodeAuditMenuTooltip"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsTag を表示します / Shows the KawaiiPhysicsTag."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "TagColumnToolTip"
				},
				{
					"Source": {
						"Text": "Matches"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MatchesColumnLabel"
				},
				{
					"Source": {
						"Text": "Refresh"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RefreshButton"
				},
				{
					"Source": {
						"Text": "RootBone"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RootBoneColumnLabel"
				},
				{
					"Source": {
						"Text": "RootBone のボーン名を表示します / Shows the RootBone bone name."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RootBoneColumnToolTip"
				},
				{
					"Source": {
						"Text": "Show Differing Only"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ShowDifferingOnlyLabel"
				},
				{
					"Source": {
						"Text": "Show in Folder"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportSucceededHyperlink"
				},
				{
					"Source": {
						"Text": "Tag"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "TagColumnLabel"
				},
				{
					"Source": {
						"Text": "View Diff"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffButton"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffContextLabel"
				},
				{
					"Source": {
						"Text": "{0} nodes, {1} differ"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "AuditSummaryFormat"
				},
				{
					"Source": {
						"Text": "✓"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MatchesCheckMark"
				},
				{
					"Source": {
						"Text": "このノードとマッチしたプリセットの差分を表示します / Shows the diff between this node and its matched preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffButtonToolTip"
				},
				{
					"Source": {
						"Text": "このプリセットを、対象タグに一致するプロジェクト内の全ノードへ適用します / Applies this preset to every node in the project that matches its target tags."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectButtonToolTip"
				},
				{
					"Source": {
						"Text": "ノードとマッチしたプリセットの差分をウィンドウで表示します / Shows the diff between the node and its matched preset in a window."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ViewDiffColumnToolTip"
				},
				{
					"Source": {
						"Text": "ノードを含むグラフ名を表示します / Shows the name of the graph that owns the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GraphColumnToolTip"
				},
				{
					"Source": {
						"Text": "プリセットと一致していない行だけを表示します（表示のみのフィルタ） / Shows only rows that do not match the preset (display filter only)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ShowDifferingOnlyToolTip"
				},
				{
					"Source": {
						"Text": "プリセットと一致していればチェック、そうでなければ差分プロパティ数を表示します / Shows a check mark when the node matches the preset, otherwise the number of differing properties."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MatchesColumnToolTip"
				},
				{
					"Source": {
						"Text": "プリセットを対象ノードへドライラン適用し直し、一覧を再計算します / Re-runs a dry-run apply of the preset against the target nodes and rebuilds the list."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RefreshButtonToolTip"
				},
				{
					"Source": {
						"Text": "差分のあるプロパティ名をカンマ区切りで表示します / Shows differing property names, comma-separated."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DiffPropertiesColumnToolTip"
				},
				{
					"Source": {
						"Text": "監査結果なし: プリセット DataAsset 詳細の [Find Target Nodes] / [Apply To Project (Dry Run)] から開いてください / No audit results: open from the preset DataAsset details."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NoAuditResultsGuidance"
				},
				{
					"Source": {
						"Text": "監査結果を JSON または CSV ファイルへ書き出します / Exports the audit results to a JSON or CSV file."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExportButtonToolTip"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsPresetDataAssetDetails",
			"Children": [
				{
					"Source": {
						"Text": "Apply To Project (Dry Run): {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectDryRunWindowTitle"
				},
				{
					"Source": {
						"Text": "Dry run: {0} nodes matched, {1} differ from preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyToProjectDryRunResult"
				},
				{
					"Source": {
						"Text": "Find Target Nodes: {0}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FindTargetNodesWindowTitle"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsPresetTargetTools"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysicsPresetTargetTools"
				},
				{
					"Source": {
						"Text": "Searching AnimBlueprints for KawaiiPhysics nodes..."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FindTargetNodesProgress"
				},
				{
					"Source": {
						"Text": "TargetTags is empty - no nodes will be targeted."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "TargetTagsEmpty"
				},
				{
					"Source": {
						"Text": "TargetTags に一致する KawaiiPhysics ノードをプロジェクト内の全 AnimBlueprint から検索し、結果をタブで一覧表示します（詳細は Output Log にも出力） / Searches all AnimBlueprints in the project for KawaiiPhysics nodes matching TargetTags and lists the results in a tab (details are also logged to the Output Log)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FindTargetNodesToolTip"
				},
				{
					"Source": {
						"Text": "{0} nodes in {1} AnimBlueprints match TargetTags."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FindTargetNodesResult"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsPresetDiffWindow",
			"Children": [
				{
					"Source": {
						"Text": "Applied selected properties to the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedSucceeded"
				},
				{
					"Source": {
						"Text": "Applied the preset to the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetSucceeded"
				},
				{
					"Source": {
						"Text": "Apply Preset to Node"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetToNodeButton"
				},
				{
					"Source": {
						"Text": "Apply Selected"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedButton"
				},
				{
					"Source": {
						"Text": "Apply Selected Kawaii Physics Preset Properties"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedTransaction"
				},
				{
					"Source": {
						"Text": "Category"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CategoryColumnLabel"
				},
				{
					"Source": {
						"Text": "Copied preset diff to clipboard."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CopySucceeded"
				},
				{
					"Source": {
						"Text": "Failed to apply the preset to the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to copy one or more properties to the preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetCopyFailed"
				},
				{
					"Source": {
						"Text": "Failed to copy one or more selected properties."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedCopyFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenAnimBlueprintFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RefreshResolveFailed"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Preset Diff"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetDiffMenuDisplayName"
				},
				{
					"Source": {
						"Text": "Kawaii Preset Diff"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetDiffTabLabel"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics のプリセット差分タブを開きます / Opens the KawaiiPhysics preset diff tab."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetDiffMenuTooltip"
				},
				{
					"Source": {
						"Text": "Matches preset"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MatchesPresetSummary"
				},
				{
					"Source": {
						"Text": "No Preset"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NoPresetSelected"
				},
				{
					"Source": {
						"Text": "No differing properties to update."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NoPresetPropertiesToUpdate"
				},
				{
					"Source": {
						"Text": "No preset selected"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NoSnapshotSummary"
				},
				{
					"Source": {
						"Text": "Node Value"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NodeValueColumnLabel"
				},
				{
					"Source": {
						"Text": "Preset Value"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetValueColumnLabel"
				},
				{
					"Source": {
						"Text": "Property"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PropertyColumnLabel"
				},
				{
					"Source": {
						"Text": "Show All Properties"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ShowAllPropertiesLabel"
				},
				{
					"Source": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetChanged"
				},
				{
					"Source": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedPresetChanged"
				},
				{
					"Source": {
						"Text": "Update Kawaii Physics Preset From Node"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetTransaction"
				},
				{
					"Source": {
						"Text": "Update Preset from Node"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetFromNodeButton"
				},
				{
					"Source": {
						"Text": "Update preset '{0}' from the node and overwrite {1} properties?"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetConfirm"
				},
				{
					"Source": {
						"Text": "Updated the preset from the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetSucceeded"
				},
				{
					"Source": {
						"Text": "{0} properties differ"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DiffCountSummary"
				},
				{
					"Source": {
						"Text": "このプロパティを Apply Selected / Update Preset from Node の対象にします / Selects this property for Apply Selected or Update Preset from Node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RowSelectionToolTip"
				},
				{
					"Source": {
						"Text": "カテゴリ、表示名、内部プロパティ名で絞り込みます / Filters by category, display name, or internal property name."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SearchToolTip"
				},
				{
					"Source": {
						"Text": "チェックしたプロパティだけをプリセットからノードへ適用します / Applies only checked properties from the preset to the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplySelectedButtonToolTip"
				},
				{
					"Source": {
						"Text": "チェックした差分、または未チェック時は全差分をノードからプリセットへ反映します / Updates checked diffs, or all diffs when none are checked, from the node to the preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UpdatePresetFromNodeButtonToolTip"
				},
				{
					"Source": {
						"Text": "ノードを再解決して差分を再計算します / Re-resolves the node and rebuilds the diffs."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RefreshButtonToolTip"
				},
				{
					"Source": {
						"Text": "プリセット側の値を表示します / Shows the value stored in the preset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetValueColumnToolTip"
				},
				{
					"Source": {
						"Text": "プロパティを操作対象として選択します / Selects a property for operations."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SelectionColumnToolTip"
				},
				{
					"Source": {
						"Text": "プロパティカテゴリを表示します / Shows the property category."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CategoryColumnToolTip"
				},
				{
					"Source": {
						"Text": "一致しているプロパティも表示します / Shows properties that already match too."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ShowAllPropertiesToolTip"
				},
				{
					"Source": {
						"Text": "差分をタブ区切りテキストとしてクリップボードへコピーします / Copies the diff as tab-separated text to the clipboard."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CopyButtonToolTip"
				},
				{
					"Source": {
						"Text": "差分未選択: KawaiiPhysics ノードの [Check Preset Diff] から開いてください / No diff selected: open from a KawaiiPhysics node's [Check Preset Diff]."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NoDiffSelectedGuidance"
				},
				{
					"Source": {
						"Text": "現在のノード側の値を表示します / Shows the current value on the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "NodeValueColumnToolTip"
				},
				{
					"Source": {
						"Text": "表示するプリセット差分を選択します / Selects the preset diff to display."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PresetComboToolTip"
				},
				{
					"Source": {
						"Text": "表示名を表示し、ツールチップで内部名を表示します / Shows the display name, with the internal name in the tooltip."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PropertyColumnToolTip"
				},
				{
					"Source": {
						"Text": "選択中のプリセットアセットを開きます / Opens the selected preset asset."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenPresetButtonToolTip"
				},
				{
					"Source": {
						"Text": "選択中のプリセット全体をノードへ適用します / Applies the whole selected preset to the node."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ApplyPresetToNodeButtonToolTip"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindPresetDataAsset",
			"Children": [
				{
					"Source": {
						"Text": "Breeze"
					},
					"Translation": {
						"Text": "そよ風"
					},
					"Key": "BreezePresetName"
				},
				{
					"Source": {
						"Text": "Storm"
					},
					"Translation": {
						"Text": "嵐"
					},
					"Key": "StormPresetName"
				},
				{
					"Source": {
						"Text": "Strong"
					},
					"Translation": {
						"Text": "強風"
					},
					"Key": "StrongPresetName"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindScopeEditPanel",
			"Children": [
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaPlusGust"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaPlusOscillation"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaPlusRandom"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaPlusWave"
				},
				{
					"Source": {
						"Text": " = ("
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaEquals"
				},
				{
					"Source": {
						"Text": "({0}, {1}, {2})"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LiveVectorValueFormat"
				},
				{
					"Source": {
						"Text": ") * Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaEnvelopePrefix"
				},
				{
					"Source": {
						"Text": ";"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaSemicolon"
				},
				{
					"Source": {
						"Text": "?"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaHelpButton"
				},
				{
					"Source": {
						"Text": "Common"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CommonGroupLabel"
				},
				{
					"Source": {
						"Text": "Composition formula help."
					},
					"Translation": {
						"Text": "合成式のヘルプ"
					},
					"Key": "FormulaHelpTooltip"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DirectionGroupLabel"
				},
				{
					"Source": {
						"Text": "Edit the curve in the Details panel"
					},
					"Translation": {
						"Text": "カーブ(ForceRateByBoneLengthRate)は詳細パネルで編集"
					},
					"Key": "CurveEditGuide"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EnvelopeGroupLabel"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaEnvelope"
				},
				{
					"Source": {
						"Text": "Focus Node"
					},
					"Translation": {
						"Text": "ノードへフォーカス"
					},
					"Key": "FocusNodeButton"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaGust"
				},
				{
					"Source": {
						"Text": "Gust maps to the Gust button and S/R/D inputs above."
					},
					"Translation": {
						"Text": "Gust は上部の Gust ボタンと S/R/D 入力に対応"
					},
					"Key": "FormulaHelpGroupLine2"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaOscillation"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OscillationGroupLabel"
				},
				{
					"Source": {
						"Text": "Pin-driven values take precedence over panel edits."
					},
					"Translation": {
						"Text": "ピン接続中のパラメータはグラフ側の値が優先されます"
					},
					"Key": "PinDrivenWarningTooltip"
				},
				{
					"Source": {
						"Text": "Procedural Wind"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EditPanelHeader"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaRandom"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RandomGroupLabel"
				},
				{
					"Source": {
						"Text": "Reset to default."
					},
					"Translation": {
						"Text": "既定値へ戻します"
					},
					"Key": "ResetToDefaultTooltip"
				},
				{
					"Source": {
						"Text": "Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaSteadyPrefix"
				},
				{
					"Source": {
						"Text": "Sample."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaTotalPrefix"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaSteady"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SteadyGroupLabel"
				},
				{
					"Source": {
						"Text": "Steady, Oscillation, Wave, Envelope, and Random map to their groups."
					},
					"Translation": {
						"Text": "Steady/Oscillation/Wave/Envelope/Random は同名グループに対応"
					},
					"Key": "FormulaHelpGroupLine1"
				},
				{
					"Source": {
						"Text": "Time"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "TimeGroupLabel"
				},
				{
					"Source": {
						"Text": "Total"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaTotal"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FormulaWave"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WaveGroupLabel"
				},
				{
					"Source": {
						"Text": "false"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LiveBoolFalse"
				},
				{
					"Source": {
						"Text": "true"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LiveBoolTrue"
				},
				{
					"Source": {
						"Text": "→ {0} (live)"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LiveValueFormat"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindScopeWindow",
			"Children": [
				{
					"Source": {
						"Text": "#{0} ProceduralWind"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ExternalForceItemFormat"
				},
				{
					"Source": {
						"Text": "#{0} ProceduralWind"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SelectedExternalForceFormat"
				},
				{
					"Source": {
						"Text": "Add New Preset"
					},
					"Translation": {
						"Text": "新規追加"
					},
					"Key": "SavePresetAddNewMenu"
				},
				{
					"Source": {
						"Text": "Add current parameters as a new preset."
					},
					"Translation": {
						"Text": "現在のパラメータを新しいプリセットとして追加します"
					},
					"Key": "SavePresetAddNewTooltip"
				},
				{
					"Source": {
						"Text": "Applied {0} wind preset. (live)"
					},
					"Translation": {
						"Text": "風プリセット {0} を適用しました。(ライブ)"
					},
					"Key": "ApplyPresetSucceededLive"
				},
				{
					"Source": {
						"Text": "Applied {0} wind preset. (node only — no live target)"
					},
					"Translation": {
						"Text": "風プリセット {0} を適用しました。(ノードのみ — ライブ対象なし)"
					},
					"Key": "ApplyPresetSucceededNodeOnly"
				},
				{
					"Source": {
						"Text": "Apply Kawaii Physics Wind Preset"
					},
					"Translation": {
						"Text": "Kawaii Physics 風プリセットの適用"
					},
					"Key": "ApplyWindPresetTransaction"
				},
				{
					"Source": {
						"Text": "Clipboard does not contain ProceduralWind parameters."
					},
					"Translation": {
						"Text": "クリップボードに ProceduralWind パラメータがありません"
					},
					"Key": "PasteWindParametersInvalidClipboard"
				},
				{
					"Source": {
						"Text": "Copied ProceduralWind parameters to clipboard."
					},
					"Translation": {
						"Text": "ProceduralWind パラメータをクリップボードへコピーしました"
					},
					"Key": "CopyWindParametersSucceeded"
				},
				{
					"Source": {
						"Text": "Copy current ProceduralWind parameters."
					},
					"Translation": {
						"Text": "現在のProceduralWindパラメータをコピー"
					},
					"Key": "CopyWindParametersTooltip"
				},
				{
					"Source": {
						"Text": "Custom {0}"
					},
					"Translation": {
						"Text": "カスタム {0}"
					},
					"Key": "SavePresetCustomNameFormat"
				},
				{
					"Source": {
						"Text": "D"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GustDecayShortLabel"
				},
				{
					"Source": {
						"Text": "Edit Kawaii Physics Wind Parameter"
					},
					"Translation": {
						"Text": "Kawaii Physics 風パラメータの編集"
					},
					"Key": "EditWindParameterTransaction"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EnvelopeLabel"
				},
				{
					"Source": {
						"Text": "Failed to load the Wind Scope Preset Data Asset."
					},
					"Translation": {
						"Text": "Wind Scope Preset Data Asset の読み込みに失敗しました"
					},
					"Key": "SavePresetLoadDataAssetFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "KawaiiPhysics グラフノードを特定できませんでした"
					},
					"Key": "ApplyPresetNoNode"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "KawaiiPhysics グラフノードを特定できませんでした"
					},
					"Key": "FocusWindScopeNodeFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Translation": {
						"Text": "風パラメータのプロパティを特定できませんでした"
					},
					"Key": "EditWindParamPropertyMissing"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Translation": {
						"Text": "風パラメータのプロパティを特定できませんでした"
					},
					"Key": "ResetWindParamPropertyMissing"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind preset to overwrite."
					},
					"Translation": {
						"Text": "上書き対象の風プリセットを特定できませんでした"
					},
					"Key": "SavePresetInvalidOverwriteTarget"
				},
				{
					"Source": {
						"Text": "Failed to update the wind parameter."
					},
					"Translation": {
						"Text": "風パラメータの更新に失敗しました"
					},
					"Key": "EditWindParamSetFailed"
				},
				{
					"Source": {
						"Text": "Force"
					},
					"Translation": {
						"Text": "外力"
					},
					"Key": "ExternalForceLabel"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GustButton"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GustLabel"
				},
				{
					"Source": {
						"Text": "Gust decay time."
					},
					"Translation": {
						"Text": "突風の減衰時間"
					},
					"Key": "GustDecaySpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust decay time."
					},
					"Translation": {
						"Text": "突風の減衰時間"
					},
					"Key": "GustDecayTooltip"
				},
				{
					"Source": {
						"Text": "Gust rise time."
					},
					"Translation": {
						"Text": "突風の立ち上がり時間"
					},
					"Key": "GustRiseSpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust rise time."
					},
					"Translation": {
						"Text": "突風の立ち上がり時間"
					},
					"Key": "GustRiseTooltip"
				},
				{
					"Source": {
						"Text": "Gust strength."
					},
					"Translation": {
						"Text": "突風の強さ"
					},
					"Key": "GustStrengthSpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust strength."
					},
					"Translation": {
						"Text": "突風の強さ"
					},
					"Key": "GustStrengthTooltip"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Wind Scope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WindScopeMenuDisplayName"
				},
				{
					"Source": {
						"Text": "Kawaii Wind Scope"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WindScopeTabLabel"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics Node"
					},
					"Translation": {
						"Text": "KawaiiPhysics ノード"
					},
					"Key": "UnknownTargetNode"
				},
				{
					"Source": {
						"Text": "Live"
					},
					"Translation": {
						"Text": "ライブ"
					},
					"Key": "LiveModeTick"
				},
				{
					"Source": {
						"Text": "No ProceduralWind"
					},
					"Translation": {
						"Text": "ProceduralWind なし"
					},
					"Key": "NoExternalForceSelected"
				},
				{
					"Source": {
						"Text": "No ProceduralWind external force was found."
					},
					"Translation": {
						"Text": "ProceduralWind の外力が見つかりませんでした"
					},
					"Key": "ApplyPresetNoWind"
				},
				{
					"Source": {
						"Text": "No node selected: open from [Wind Scope] on a KawaiiPhysics node."
					},
					"Translation": {
						"Text": "ノード未選択: KawaiiPhysics ノードの [Wind Scope] から開いてください"
					},
					"Key": "NoTargetNodeGuidance"
				},
				{
					"Source": {
						"Text": "None"
					},
					"Translation": {
						"Text": "なし"
					},
					"Key": "NoExternalForceItem"
				},
				{
					"Source": {
						"Text": "Open Project Settings"
					},
					"Translation": {
						"Text": "プロジェクト設定を開く"
					},
					"Key": "OpenProjectSettingsMenu"
				},
				{
					"Source": {
						"Text": "Open Project Settings > Plugins > Kawaii Physics."
					},
					"Translation": {
						"Text": "Project Settings > Plugins > Kawaii Physics を開きます"
					},
					"Key": "OpenProjectSettingsTooltip"
				},
				{
					"Source": {
						"Text": "Opens the KawaiiPhysics wind preview tab."
					},
					"Translation": {
						"Text": "KawaiiPhysics の風プレビュータブを開きます"
					},
					"Key": "WindScopeMenuTooltip"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OscillationLabel"
				},
				{
					"Source": {
						"Text": "Overwrite this preset with current parameters."
					},
					"Translation": {
						"Text": "現在のパラメータでこのプリセットを上書きします"
					},
					"Key": "SavePresetOverwriteTooltip"
				},
				{
					"Source": {
						"Text": "Overwrite:"
					},
					"Translation": {
						"Text": "既存を上書き:"
					},
					"Key": "SavePresetOverwriteSection"
				},
				{
					"Source": {
						"Text": "Overwrote {0} wind preset."
					},
					"Translation": {
						"Text": "風プリセット {0} を上書きしました"
					},
					"Key": "SavePresetSucceededOverwrite"
				},
				{
					"Source": {
						"Text": "Paste Kawaii Physics Wind Parameters"
					},
					"Translation": {
						"Text": "Kawaii Physics 風パラメータの貼り付け"
					},
					"Key": "PasteWindParametersTransaction"
				},
				{
					"Source": {
						"Text": "Paste ProceduralWind parameters from the clipboard."
					},
					"Translation": {
						"Text": "クリップボードからProceduralWindパラメータを貼り付け"
					},
					"Key": "PasteWindParametersTooltip"
				},
				{
					"Source": {
						"Text": "Pasted ProceduralWind parameters. (live)"
					},
					"Translation": {
						"Text": "ProceduralWind パラメータを貼り付けました。(ライブ)"
					},
					"Key": "PasteWindParametersSucceededLive"
				},
				{
					"Source": {
						"Text": "Pasted ProceduralWind parameters. (node only — no live target)"
					},
					"Translation": {
						"Text": "ProceduralWind パラメータを貼り付けました。(ノードのみ — ライブ対象なし)"
					},
					"Key": "PasteWindParametersSucceededNodeOnly"
				},
				{
					"Source": {
						"Text": "Pause"
					},
					"Translation": {
						"Text": "一時停止"
					},
					"Key": "PauseLabel"
				},
				{
					"Source": {
						"Text": "Preset list has changed. Reload first."
					},
					"Translation": {
						"Text": "プリセット一覧が変更されています。Reload してください"
					},
					"Key": "SavePresetListChanged"
				},
				{
					"Source": {
						"Text": "Preset {0}"
					},
					"Translation": {
						"Text": "プリセット {0}"
					},
					"Key": "WindPresetFallbackNameFormat"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "プレビュー"
					},
					"Key": "InitialMode"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "プレビュー"
					},
					"Key": "PreviewMode"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "プレビュー"
					},
					"Key": "PreviewModeTick"
				},
				{
					"Source": {
						"Text": "R"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GustRiseShortLabel"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RandomLabel"
				},
				{
					"Source": {
						"Text": "Reload"
					},
					"Translation": {
						"Text": "リロード"
					},
					"Key": "ReloadPresetsButton"
				},
				{
					"Source": {
						"Text": "Reload the preset DataAsset."
					},
					"Translation": {
						"Text": "プリセットDataAssetを再読み込みします"
					},
					"Key": "ReloadPresetsTooltip"
				},
				{
					"Source": {
						"Text": "S"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "GustStrengthShortLabel"
				},
				{
					"Source": {
						"Text": "Save Kawaii Physics Wind Preset"
					},
					"Translation": {
						"Text": "Kawaii Physics 風プリセットの保存"
					},
					"Key": "SaveWindPresetTransaction"
				},
				{
					"Source": {
						"Text": "Save as Preset"
					},
					"Translation": {
						"Text": "プリセットとして保存"
					},
					"Key": "SavePresetButton"
				},
				{
					"Source": {
						"Text": "Save current parameters to the preset DataAsset."
					},
					"Translation": {
						"Text": "現在のパラメータをプリセットDataAssetへ保存します"
					},
					"Key": "SavePresetTooltip"
				},
				{
					"Source": {
						"Text": "Saved {0} wind preset."
					},
					"Translation": {
						"Text": "風プリセット {0} を保存しました"
					},
					"Key": "SavePresetSucceededAdd"
				},
				{
					"Source": {
						"Text": "Seconds"
					},
					"Translation": {
						"Text": "秒"
					},
					"Key": "DisplaySecondsLabel"
				},
				{
					"Source": {
						"Text": "Sends a test gust to the live target."
					},
					"Translation": {
						"Text": "実行中のライブ対象へテスト突風を送ります"
					},
					"Key": "GustButtonTooltip"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings first."
					},
					"Translation": {
						"Text": "プロジェクト設定で Wind Scope Preset Data Asset を設定してください"
					},
					"Key": "SavePresetNoDataAsset"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Translation": {
						"Text": "プリセットを保存するにはプロジェクト設定で Wind Scope Preset Data Asset を設定してください"
					},
					"Key": "SavePresetNoDataAssetMenuInfo"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Translation": {
						"Text": "プリセットを保存するにはプロジェクト設定で Wind Scope Preset Data Asset を設定してください"
					},
					"Key": "SavePresetNoDataAssetTooltip"
				},
				{
					"Source": {
						"Text": "Skipped wind gust. (no live target)"
					},
					"Translation": {
						"Text": "突風をスキップしました。(ライブ対象なし)"
					},
					"Key": "GustNoLiveTarget"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SteadyLabel"
				},
				{
					"Source": {
						"Text": "The selected external force is not ProceduralWind."
					},
					"Translation": {
						"Text": "選択中の外力は ProceduralWind ではありません"
					},
					"Key": "ApplyPresetInvalidWind"
				},
				{
					"Source": {
						"Text": "Toggle the parameter edit panel."
					},
					"Translation": {
						"Text": "編集パネルの表示切替"
					},
					"Key": "ToggleEditPanelTooltip"
				},
				{
					"Source": {
						"Text": "Total"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "TotalLabel"
				},
				{
					"Source": {
						"Text": "Total {0}  Steady {1}  Osc {2}  Wave {3}  Env {4}  Rand {5}  Gust {6}"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "CurrentValuesFormat"
				},
				{
					"Source": {
						"Text": "Triggered wind gust. (live)"
					},
					"Translation": {
						"Text": "突風をトリガーしました。(ライブ)"
					},
					"Key": "GustSucceededLive"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "WaveLabel"
				}
			]
		},
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "KawaiiPhysics|ExternalForce"
					},
					"Translation": {
						"Text": "KawaiiPhysics|外力"
					},
					"Key": "KawaiiPhysics|ExternalForce"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics|ExternalForce|Procedural Wind"
					},
					"Translation": {
						"Text": "KawaiiPhysics|外力|Procedural Wind"
					},
					"Key": "KawaiiPhysics|ExternalForce|Procedural Wind"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics|ExternalForce|Procedural Wind|DynamicParams"
					},
					"Translation": {
						"Text": "KawaiiPhysics|外力|Procedural Wind|動的パラメータ"
					},
					"Key": "KawaiiPhysics|ExternalForce|Procedural Wind|DynamicParams"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "Apply Bone Filter"
					},
					"Translation": {
						"Text": "適用ボーンフィルタ"
					},
					"Key": "KawaiiPhysics_ExternalForce:ApplyBoneFilter"
				},
				{
					"Source": {
						"Text": "Can Select Force Space"
					},
					"Translation": {
						"Text": "適用空間を選択可能"
					},
					"Key": "KawaiiPhysics_ExternalForce:bCanSelectForceSpace"
				},
				{
					"Source": {
						"Text": "Component Transform"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:ComponentTransform"
				},
				{
					"Source": {
						"Text": "Direction Noise Angle"
					},
					"Translation": {
						"Text": "風向きの揺らぎ角"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:DirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "Direction Noise Angle"
					},
					"Translation": {
						"Text": "風向きの揺らぎ角"
					},
					"Key": "KawaiiProceduralWindDynamicParams:DirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "Direction Noise Period"
					},
					"Translation": {
						"Text": "風向きの揺らぎ周期"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:DirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "Direction Noise Period"
					},
					"Translation": {
						"Text": "風向きの揺らぎ周期"
					},
					"Key": "KawaiiProceduralWindDynamicParams:DirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "Draw Debug"
					},
					"Translation": {
						"Text": "デバッグ表示"
					},
					"Key": "KawaiiPhysics_ExternalForce:bDrawDebug"
				},
				{
					"Source": {
						"Text": "Envelope Frequency"
					},
					"Translation": {
						"Text": "エンベロープ周波数"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "Envelope Frequency"
					},
					"Translation": {
						"Text": "エンベロープ周波数"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "Envelope Max"
					},
					"Translation": {
						"Text": "エンベロープ最大倍率"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeMax"
				},
				{
					"Source": {
						"Text": "Envelope Max"
					},
					"Translation": {
						"Text": "エンベロープ最大倍率"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeMax"
				},
				{
					"Source": {
						"Text": "Envelope Min"
					},
					"Translation": {
						"Text": "エンベロープ最小倍率"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeMin"
				},
				{
					"Source": {
						"Text": "Envelope Min"
					},
					"Translation": {
						"Text": "エンベロープ最小倍率"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeMin"
				},
				{
					"Source": {
						"Text": "Envelope Phase"
					},
					"Translation": {
						"Text": "エンベロープ位相"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopePhase"
				},
				{
					"Source": {
						"Text": "Envelope Phase"
					},
					"Translation": {
						"Text": "エンベロープ位相"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopePhase"
				},
				{
					"Source": {
						"Text": "External Force Space"
					},
					"Translation": {
						"Text": "外力の適用空間"
					},
					"Key": "KawaiiPhysics_ExternalForce:ExternalForceSpace"
				},
				{
					"Source": {
						"Text": "External Owner"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:ExternalOwner"
				},
				{
					"Source": {
						"Text": "Force"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:Force"
				},
				{
					"Source": {
						"Text": "Force Rate by Bone Length Rate"
					},
					"Translation": {
						"Text": "ボーン長割合によるForce Rate補正"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:ForceRateByBoneLengthRate"
				},
				{
					"Source": {
						"Text": "Ignore Bone Filter"
					},
					"Translation": {
						"Text": "除外ボーンフィルタ"
					},
					"Key": "KawaiiPhysics_ExternalForce:IgnoreBoneFilter"
				},
				{
					"Source": {
						"Text": "Is Enabled"
					},
					"Translation": {
						"Text": "有効"
					},
					"Key": "KawaiiPhysics_ExternalForce:bIsEnabled"
				},
				{
					"Source": {
						"Text": "Is Enabled"
					},
					"Translation": {
						"Text": "有効"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bIsEnabled"
				},
				{
					"Source": {
						"Text": "Is One Shot"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:bIsOneShot"
				},
				{
					"Source": {
						"Text": "Kawaii Physics External Force"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce"
				},
				{
					"Source": {
						"Text": "Kawaii Procedural Wind Dynamic Params"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiProceduralWindDynamicParams"
				},
				{
					"Source": {
						"Text": "Oscillation Force"
					},
					"Translation": {
						"Text": "振動風力"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:OscillationForce"
				},
				{
					"Source": {
						"Text": "Oscillation Force"
					},
					"Translation": {
						"Text": "振動風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:OscillationForce"
				},
				{
					"Source": {
						"Text": "Oscillation Period"
					},
					"Translation": {
						"Text": "振動周期"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:OscillationPeriod"
				},
				{
					"Source": {
						"Text": "Oscillation Period"
					},
					"Translation": {
						"Text": "振動周期"
					},
					"Key": "KawaiiProceduralWindDynamicParams:OscillationPeriod"
				},
				{
					"Source": {
						"Text": "Override Direction Noise Angle"
					},
					"Translation": {
						"Text": "風向きの揺らぎ角を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideDirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "Override Direction Noise Period"
					},
					"Translation": {
						"Text": "風向きの揺らぎ周期を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideDirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "Override Envelope Frequency"
					},
					"Translation": {
						"Text": "エンベロープ周波数を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "Override Envelope Max"
					},
					"Translation": {
						"Text": "エンベロープ最大倍率を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeMax"
				},
				{
					"Source": {
						"Text": "Override Envelope Min"
					},
					"Translation": {
						"Text": "エンベロープ最小倍率を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeMin"
				},
				{
					"Source": {
						"Text": "Override Envelope Phase"
					},
					"Translation": {
						"Text": "エンベロープ位相を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopePhase"
				},
				{
					"Source": {
						"Text": "Override Is Enabled"
					},
					"Translation": {
						"Text": "有効状態を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideIsEnabled"
				},
				{
					"Source": {
						"Text": "Override Oscillation Force"
					},
					"Translation": {
						"Text": "振動風力を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideOscillationForce"
				},
				{
					"Source": {
						"Text": "Override Oscillation Period"
					},
					"Translation": {
						"Text": "振動周期を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideOscillationPeriod"
				},
				{
					"Source": {
						"Text": "Override Random Force"
					},
					"Translation": {
						"Text": "ランダム風力を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideRandomForce"
				},
				{
					"Source": {
						"Text": "Override Random Period"
					},
					"Translation": {
						"Text": "ランダム周期を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideRandomPeriod"
				},
				{
					"Source": {
						"Text": "Override Steady Force"
					},
					"Translation": {
						"Text": "定常風力を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideSteadyForce"
				},
				{
					"Source": {
						"Text": "Override Time Scale"
					},
					"Translation": {
						"Text": "時間スケールを上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideTimeScale"
				},
				{
					"Source": {
						"Text": "Override Wave Amplitude"
					},
					"Translation": {
						"Text": "波の振幅を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWaveAmplitude"
				},
				{
					"Source": {
						"Text": "Override Wave Period"
					},
					"Translation": {
						"Text": "波の周期を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWavePeriod"
				},
				{
					"Source": {
						"Text": "Override Wave Phase"
					},
					"Translation": {
						"Text": "波の位相を上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWavePhase"
				},
				{
					"Source": {
						"Text": "Override Wave Spatial Offset"
					},
					"Translation": {
						"Text": "波の空間オフセットを上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "Override Wind Direction"
					},
					"Translation": {
						"Text": "風向きを上書き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWindDirection"
				},
				{
					"Source": {
						"Text": "Procedural Wind"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind"
				},
				{
					"Source": {
						"Text": "Random Force"
					},
					"Translation": {
						"Text": "ランダム風力"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomForce"
				},
				{
					"Source": {
						"Text": "Random Force"
					},
					"Translation": {
						"Text": "ランダム風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:RandomForce"
				},
				{
					"Source": {
						"Text": "Random Force Scale Range"
					},
					"Translation": {
						"Text": "外力スケールのランダム範囲"
					},
					"Key": "KawaiiPhysics_ExternalForce:RandomForceScaleRange"
				},
				{
					"Source": {
						"Text": "Random Period"
					},
					"Translation": {
						"Text": "ランダム周期"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomPeriod"
				},
				{
					"Source": {
						"Text": "Random Period"
					},
					"Translation": {
						"Text": "ランダム周期"
					},
					"Key": "KawaiiProceduralWindDynamicParams:RandomPeriod"
				},
				{
					"Source": {
						"Text": "Random Seed"
					},
					"Translation": {
						"Text": "ランダムシード"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomSeed"
				},
				{
					"Source": {
						"Text": "Randomized Force Scale"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:RandomizedForceScale"
				},
				{
					"Source": {
						"Text": "Steady Force"
					},
					"Translation": {
						"Text": "定常風力"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:SteadyForce"
				},
				{
					"Source": {
						"Text": "Steady Force"
					},
					"Translation": {
						"Text": "定常風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:SteadyForce"
				},
				{
					"Source": {
						"Text": "Time Scale"
					},
					"Translation": {
						"Text": "時間スケール"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:TimeScale"
				},
				{
					"Source": {
						"Text": "Time Scale"
					},
					"Translation": {
						"Text": "時間スケール"
					},
					"Key": "KawaiiProceduralWindDynamicParams:TimeScale"
				},
				{
					"Source": {
						"Text": "Wave Amplitude"
					},
					"Translation": {
						"Text": "波の振幅"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WaveAmplitude"
				},
				{
					"Source": {
						"Text": "Wave Amplitude"
					},
					"Translation": {
						"Text": "波の振幅"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WaveAmplitude"
				},
				{
					"Source": {
						"Text": "Wave Period"
					},
					"Translation": {
						"Text": "波の周期"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WavePeriod"
				},
				{
					"Source": {
						"Text": "Wave Period"
					},
					"Translation": {
						"Text": "波の周期"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WavePeriod"
				},
				{
					"Source": {
						"Text": "Wave Phase"
					},
					"Translation": {
						"Text": "波の位相"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WavePhase"
				},
				{
					"Source": {
						"Text": "Wave Phase"
					},
					"Translation": {
						"Text": "波の位相"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WavePhase"
				},
				{
					"Source": {
						"Text": "Wave Spatial Offset"
					},
					"Translation": {
						"Text": "波の空間オフセット"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "Wave Spatial Offset"
					},
					"Translation": {
						"Text": "波の空間オフセット"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "Wind Direction"
					},
					"Translation": {
						"Text": "風向き"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WindDirection"
				},
				{
					"Source": {
						"Text": "Wind Direction"
					},
					"Translation": {
						"Text": "風向き"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WindDirection"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "Base"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce"
				},
				{
					"Source": {
						"Text": "DirectionNoiseAngle を上書きする / Override DirectionNoiseAngle."
					},
					"Translation": {
						"Text": "DirectionNoiseAngle を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideDirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "DirectionNoisePeriod を上書きする / Override DirectionNoisePeriod."
					},
					"Translation": {
						"Text": "DirectionNoisePeriod を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideDirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "EnvelopeFrequency を上書きする / Override EnvelopeFrequency."
					},
					"Translation": {
						"Text": "EnvelopeFrequency を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "EnvelopeMax を上書きする / Override EnvelopeMax."
					},
					"Translation": {
						"Text": "EnvelopeMax を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeMax"
				},
				{
					"Source": {
						"Text": "EnvelopeMin を上書きする / Override EnvelopeMin."
					},
					"Translation": {
						"Text": "EnvelopeMin を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopeMin"
				},
				{
					"Source": {
						"Text": "EnvelopePhase を上書きする / Override EnvelopePhase."
					},
					"Translation": {
						"Text": "EnvelopePhase を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideEnvelopePhase"
				},
				{
					"Source": {
						"Text": "OscillationForce を上書きする / Override OscillationForce."
					},
					"Translation": {
						"Text": "OscillationForce を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideOscillationForce"
				},
				{
					"Source": {
						"Text": "OscillationPeriod を上書きする / Override OscillationPeriod."
					},
					"Translation": {
						"Text": "OscillationPeriod を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideOscillationPeriod"
				},
				{
					"Source": {
						"Text": "Owner of the external force"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:ExternalOwner"
				},
				{
					"Source": {
						"Text": "ProceduralWind のランタイム更新パラメータ。bOverride が true の項目だけ次回 PreApply で反映される。\nRuntime update parameters for ProceduralWind. Only entries whose bOverride flag is true are applied on the next PreApply."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiProceduralWindDynamicParams"
				},
				{
					"Source": {
						"Text": "RandomForce を上書きする / Override RandomForce."
					},
					"Translation": {
						"Text": "RandomForce を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideRandomForce"
				},
				{
					"Source": {
						"Text": "RandomPeriod を上書きする / Override RandomPeriod."
					},
					"Translation": {
						"Text": "RandomPeriod を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideRandomPeriod"
				},
				{
					"Source": {
						"Text": "Randomized scale of the force"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:RandomizedForceScale"
				},
				{
					"Source": {
						"Text": "Range for randomizing the force scale"
					},
					"Translation": {
						"Text": "外力スケールをランダム化する範囲"
					},
					"Key": "KawaiiPhysics_ExternalForce:RandomForceScaleRange"
				},
				{
					"Source": {
						"Text": "SteadyForce を上書きする / Override SteadyForce."
					},
					"Translation": {
						"Text": "SteadyForce を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideSteadyForce"
				},
				{
					"Source": {
						"Text": "The force vector"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:Force"
				},
				{
					"Source": {
						"Text": "The space in which the external force is simulated"
					},
					"Translation": {
						"Text": "外力をシミュレートする空間"
					},
					"Key": "KawaiiPhysics_ExternalForce:ExternalForceSpace"
				},
				{
					"Source": {
						"Text": "TimeScale を上書きする / Override TimeScale."
					},
					"Translation": {
						"Text": "TimeScale を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideTimeScale"
				},
				{
					"Source": {
						"Text": "Transform of the component"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:ComponentTransform"
				},
				{
					"Source": {
						"Text": "WaveAmplitude を上書きする / Override WaveAmplitude."
					},
					"Translation": {
						"Text": "WaveAmplitude を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWaveAmplitude"
				},
				{
					"Source": {
						"Text": "WavePeriod を上書きする / Override WavePeriod."
					},
					"Translation": {
						"Text": "WavePeriod を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWavePeriod"
				},
				{
					"Source": {
						"Text": "WavePhase を上書きする / Override WavePhase."
					},
					"Translation": {
						"Text": "WavePhase を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWavePhase"
				},
				{
					"Source": {
						"Text": "WaveSpatialOffset を上書きする / Override WaveSpatialOffset."
					},
					"Translation": {
						"Text": "WaveSpatialOffset を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "Whether the external force is applied only once"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "KawaiiPhysics_ExternalForce:bIsOneShot"
				},
				{
					"Source": {
						"Text": "Whether the external force is enabled"
					},
					"Translation": {
						"Text": "外力を有効にするか"
					},
					"Key": "KawaiiPhysics_ExternalForce:bIsEnabled"
				},
				{
					"Source": {
						"Text": "Whether the force space can be selected"
					},
					"Translation": {
						"Text": "適用空間を選択可能かどうか"
					},
					"Key": "KawaiiPhysics_ExternalForce:bCanSelectForceSpace"
				},
				{
					"Source": {
						"Text": "Whether to draw debug information for the external force"
					},
					"Translation": {
						"Text": "外力のデバッグ情報を表示するか"
					},
					"Key": "KawaiiPhysics_ExternalForce:bDrawDebug"
				},
				{
					"Source": {
						"Text": "WindDirection を上書きする / Override WindDirection."
					},
					"Translation": {
						"Text": "WindDirection を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideWindDirection"
				},
				{
					"Source": {
						"Text": "bIsEnabled を上書きする / Override bIsEnabled."
					},
					"Translation": {
						"Text": "bIsEnabled を上書きする"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bOverrideIsEnabled"
				},
				{
					"Source": {
						"Text": "うねりの速さ（Hz）。低いほどゆったり。Wind Scope の Envelope 系列に対応\nSwell speed in Hz. Lower is slower. Corresponds to the Envelope series in Wind Scope."
					},
					"Translation": {
						"Text": "うねりの速さ（Hz）。低いほどゆったり。Wind Scope の Envelope 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "この外力内の時間の進み。0で凍結、2で倍速\nTime scale of this force. 0 freezes, 2 doubles speed."
					},
					"Translation": {
						"Text": "この外力内の時間の進み。0で凍結、2で倍速"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:TimeScale"
				},
				{
					"Source": {
						"Text": "エンベロープ位相 / Envelope phase."
					},
					"Translation": {
						"Text": "エンベロープ位相"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopePhase"
				},
				{
					"Source": {
						"Text": "エンベロープ周波数（Hz） / Envelope frequency, in Hz."
					},
					"Translation": {
						"Text": "エンベロープ周波数（Hz）"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeFrequency"
				},
				{
					"Source": {
						"Text": "エンベロープ最大値 / Maximum envelope value."
					},
					"Translation": {
						"Text": "エンベロープ最大値"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeMax"
				},
				{
					"Source": {
						"Text": "エンベロープ最小値 / Minimum envelope value."
					},
					"Translation": {
						"Text": "エンベロープ最小値"
					},
					"Key": "KawaiiProceduralWindDynamicParams:EnvelopeMin"
				},
				{
					"Source": {
						"Text": "エンベロープ（強弱のうねり）の開始位相オフセット。複数キャラや複数外力のうねりタイミングをずらす用途。Wind Scope の Envelope 系列に対応\nStart phase offset of the envelope (strength undulation). Use to stagger envelope timing across multiple characters or external forces. Corresponds to the Envelope series in Wind Scope."
					},
					"Translation": {
						"Text": "エンベロープ（強弱のうねり）の開始位相オフセット。複数キャラや複数外力のうねりタイミングをずらす用途。Wind Scope の Envelope 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopePhase"
				},
				{
					"Source": {
						"Text": "サイン波で周期的に強弱する成分の振幅。上げると規則的な揺れが強くなる。Wind Scope の Oscillation 系列に対応\nAmplitude of the sine-based oscillation. Higher values strengthen the rhythmic sway. Corresponds to the Oscillation series in Wind Scope."
					},
					"Translation": {
						"Text": "サイン波で周期的に強弱する成分の振幅。上げると規則的な揺れが強くなる。Wind Scope の Oscillation 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:OscillationForce"
				},
				{
					"Source": {
						"Text": "パラメトリック合成風。UE の WindDirectionalSource に依存しない。\n合成式: Total = (SteadyForce + Oscillation + Wave) × Envelope + Random + Gust（Gust は TriggerProceduralWindGust API から発生）\nParametric synthesized wind. This does not depend on UE WindDirectionalSource.\nComposition: Total = (SteadyForce + Oscillation + Wave) x Envelope + Random + Gust (Gust is triggered via the TriggerProceduralWindGust API)."
					},
					"Translation": {
						"Text": "パラメトリック合成風。UE の WindDirectionalSource に依存しない。\n合成式: Total = (SteadyForce + Oscillation + Wave) × Envelope + Random + Gust（Gust は TriggerProceduralWindGust API から発生）"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind"
				},
				{
					"Source": {
						"Text": "ボーン列に沿って伝わる波成分の振幅。WaveSpatialOffset と組で使う。Wind Scope の Wave 系列に対応\nAmplitude of the traveling wave along the bone chain. Use together with WaveSpatialOffset. Corresponds to the Wave series in Wind Scope."
					},
					"Translation": {
						"Text": "ボーン列に沿って伝わる波成分の振幅。WaveSpatialOffset と組で使う。Wind Scope の Wave 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WaveAmplitude"
				},
				{
					"Source": {
						"Text": "ランダム系列のシード。同じ値なら同じ揺らぎを再現できる。基底の RandomForceScaleRange が (1,1) 以外の場合は再現性が失われる。PIE中のライブ反映対象外（ノード値のみ・次回再生から反映）\nSeed of the random sequence. Same seed reproduces the same fluctuation. Reproducibility is lost if the base RandomForceScaleRange is not (1,1). Not live-updated during PIE; the node value takes effect from the next play session."
					},
					"Translation": {
						"Text": "ランダム系列のシード。同じ値なら同じ揺らぎを再現できる。基底の RandomForceScaleRange が (1,1) 以外の場合は再現性が失われる。PIE中のライブ反映対象外（ノード値のみ・次回再生から反映）"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomSeed"
				},
				{
					"Source": {
						"Text": "ランダム風力 / Random wind force."
					},
					"Translation": {
						"Text": "ランダム風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:RandomForce"
				},
				{
					"Source": {
						"Text": "ランダム風力の周期（秒） / Random wind period, in seconds."
					},
					"Translation": {
						"Text": "ランダム風力の周期（秒）"
					},
					"Key": "KawaiiProceduralWindDynamicParams:RandomPeriod"
				},
				{
					"Source": {
						"Text": "不規則な揺らぎ成分の強さ。自然なランダム感を足す。Wind Scope の Random 系列に対応\nStrength of the irregular fluctuation. Adds natural randomness. Corresponds to the Random series in Wind Scope."
					},
					"Translation": {
						"Text": "不規則な揺らぎ成分の強さ。自然なランダム感を足す。Wind Scope の Random 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomForce"
				},
				{
					"Source": {
						"Text": "各ボーンに適用するForce Rateを補正。\n「RootBoneから特定のボーンまでの長さ / RootBoneから末端のボーンまでの長さ」(0.0~1.0)の値におけるカーブの値をForceRateに乗算\nCorrects the Force Rate applied to each bone.\nMultiplies the ForceRate by the curve value for \"Length from RootBone to specific bone / Length from RootBone to end bone\" (0.0~1.0)"
					},
					"Translation": {
						"Text": "各ボーンに適用するForce Rateを補正。\n「RootBoneから特定のボーンまでの長さ / RootBoneから末端のボーンまでの長さ」(0.0~1.0)の値におけるカーブの値をForceRateに乗算"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:ForceRateByBoneLengthRate"
				},
				{
					"Source": {
						"Text": "向きの揺らぎの周期（秒）\nPeriod of the direction wander, in seconds."
					},
					"Translation": {
						"Text": "向きの揺らぎの周期（秒）"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:DirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "外力の有効状態 / External force enabled state."
					},
					"Translation": {
						"Text": "外力の有効状態"
					},
					"Key": "KawaiiProceduralWindDynamicParams:bIsEnabled"
				},
				{
					"Source": {
						"Text": "外力を適用しないボーンを指定\nSpecify the bones to which the external force will NOT be applied"
					},
					"Translation": {
						"Text": "外力を適用しないボーンを指定"
					},
					"Key": "KawaiiPhysics_ExternalForce:IgnoreBoneFilter"
				},
				{
					"Source": {
						"Text": "外力を適用するボーンを指定（＝指定しなかったボーンには適用しない）\n空の場合、全ての物理対象のボーンに適用\nSpecify the bones to which the external force will be applied (= the force will not be applied to bones that are not specified)\nIf empty, it will be applied to all physical target bones"
					},
					"Translation": {
						"Text": "外力を適用するボーンを指定（＝指定しなかったボーンには適用しない）\n空の場合、全ての物理対象のボーンに適用"
					},
					"Key": "KawaiiPhysics_ExternalForce:ApplyBoneFilter"
				},
				{
					"Source": {
						"Text": "定常風力 / Steady wind force."
					},
					"Translation": {
						"Text": "定常風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:SteadyForce"
				},
				{
					"Source": {
						"Text": "常に一定で掛かる風の強さ。上げるとボーンが風下へ流されたままになる。Wind Scope の Steady 系列に対応\nConstant wind strength. Higher values keep bones pushed downwind. Corresponds to the Steady series in Wind Scope."
					},
					"Translation": {
						"Text": "常に一定で掛かる風の強さ。上げるとボーンが風下へ流されたままになる。Wind Scope の Steady 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:SteadyForce"
				},
				{
					"Source": {
						"Text": "振動の周期（秒）。短いほど速く揺れる。Wind Scope の Oscillation 系列に対応\nOscillation period in seconds. Shorter values sway faster. Corresponds to the Oscillation series in Wind Scope."
					},
					"Translation": {
						"Text": "振動の周期（秒）。短いほど速く揺れる。Wind Scope の Oscillation 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:OscillationPeriod"
				},
				{
					"Source": {
						"Text": "振動周期（秒） / Oscillation period, in seconds."
					},
					"Translation": {
						"Text": "振動周期（秒）"
					},
					"Key": "KawaiiProceduralWindDynamicParams:OscillationPeriod"
				},
				{
					"Source": {
						"Text": "振動風力 / Oscillating wind force."
					},
					"Translation": {
						"Text": "振動風力"
					},
					"Key": "KawaiiProceduralWindDynamicParams:OscillationForce"
				},
				{
					"Source": {
						"Text": "揺らぎが変化する速さ（秒）。短いほど細かく震える。Wind Scope の Random 系列に対応\nHow fast the fluctuation changes, in seconds. Shorter values jitter faster. Corresponds to the Random series in Wind Scope."
					},
					"Translation": {
						"Text": "揺らぎが変化する速さ（秒）。短いほど細かく震える。Wind Scope の Random 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:RandomPeriod"
				},
				{
					"Source": {
						"Text": "方向揺らぎの円錐半角 / Cone half-angle for directional noise."
					},
					"Translation": {
						"Text": "方向揺らぎの円錐半角"
					},
					"Key": "KawaiiProceduralWindDynamicParams:DirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "方向揺らぎの周期（秒） / Period for directional noise, in seconds."
					},
					"Translation": {
						"Text": "方向揺らぎの周期（秒）"
					},
					"Key": "KawaiiProceduralWindDynamicParams:DirectionNoisePeriod"
				},
				{
					"Source": {
						"Text": "時間スケール / Time scale."
					},
					"Translation": {
						"Text": "時間スケール"
					},
					"Key": "KawaiiProceduralWindDynamicParams:TimeScale"
				},
				{
					"Source": {
						"Text": "毛先 r=1 での位相遅れ量 / Phase delay at tip r=1."
					},
					"Translation": {
						"Text": "毛先 r=1 での位相遅れ量"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "毛先（LengthRate=1）での位相遅れ量。正の値で根元から毛先へ波が走って見える。0なら全ボーン同時に揺れる。Wind Scope の Wave 系列に対応\nPhase delay at the tip. Positive values make the wave travel from root to tip; 0 sways all bones together. Corresponds to the Wave series in Wind Scope."
					},
					"Translation": {
						"Text": "毛先（LengthRate=1）での位相遅れ量。正の値で根元から毛先へ波が走って見える。0なら全ボーン同時に揺れる。Wind Scope の Wave 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WaveSpatialOffset"
				},
				{
					"Source": {
						"Text": "波の周期（秒）。Wind Scope の Wave 系列に対応\nWave period in seconds. Corresponds to the Wave series in Wind Scope."
					},
					"Translation": {
						"Text": "波の周期（秒）。Wind Scope の Wave 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WavePeriod"
				},
				{
					"Source": {
						"Text": "波成分の開始位相オフセット。複数キャラや複数外力の波のタイミングをずらす用途。Wind Scope の Wave 系列に対応\nStart phase offset of the wave component. Use to stagger wave timing across multiple characters or external forces. Corresponds to the Wave series in Wind Scope."
					},
					"Translation": {
						"Text": "波成分の開始位相オフセット。複数キャラや複数外力の波のタイミングをずらす用途。Wind Scope の Wave 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WavePhase"
				},
				{
					"Source": {
						"Text": "空間波の位相 / Spatial wave phase."
					},
					"Translation": {
						"Text": "空間波の位相"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WavePhase"
				},
				{
					"Source": {
						"Text": "空間波の周期（秒） / Spatial wave period, in seconds."
					},
					"Translation": {
						"Text": "空間波の周期（秒）"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WavePeriod"
				},
				{
					"Source": {
						"Text": "空間波の振幅 / Spatial wave amplitude."
					},
					"Translation": {
						"Text": "空間波の振幅"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WaveAmplitude"
				},
				{
					"Source": {
						"Text": "風の吹く方向。BP からは SetExternalForceVectorProperty(\"WindDirection\") で変更可能。内部で正規化するため非正規化でも可\nDirection the wind blows. Controllable from BP via SetExternalForceVectorProperty(\"WindDirection\"). Non-normalized values are allowed because this is normalized internally."
					},
					"Translation": {
						"Text": "風の吹く方向。BP からは SetExternalForceVectorProperty(\"WindDirection\") で変更可能。内部で正規化するため非正規化でも可"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:WindDirection"
				},
				{
					"Source": {
						"Text": "風全体の強弱のうねり（低周波変調）の上限倍率。Min を下げると凪↔強風の緩急が生まれる。Min=Max=1 で無効。Wind Scope の Envelope 系列に対応\nUpper multiplier of the slow global intensity swell. Lower Min creates calm-to-gust dynamics. Disabled when Min=Max=1. Corresponds to the Envelope series in Wind Scope."
					},
					"Translation": {
						"Text": "風全体の強弱のうねり（低周波変調）の上限倍率。Min を下げると凪↔強風の緩急が生まれる。Min=Max=1 で無効。Wind Scope の Envelope 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeMax"
				},
				{
					"Source": {
						"Text": "風全体の強弱のうねり（低周波変調）の下限倍率。Min を下げると凪↔強風の緩急が生まれる。Min=Max=1 で無効。Wind Scope の Envelope 系列に対応\nLower multiplier of the slow global intensity swell. Lower Min creates calm-to-gust dynamics. Disabled when Min=Max=1. Corresponds to the Envelope series in Wind Scope."
					},
					"Translation": {
						"Text": "風全体の強弱のうねり（低周波変調）の下限倍率。Min を下げると凪↔強風の緩急が生まれる。Min=Max=1 で無効。Wind Scope の Envelope 系列に対応"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:EnvelopeMin"
				},
				{
					"Source": {
						"Text": "風向き自体の揺らぎの円錐半角。向きの単調さを消す\nCone half-angle of the wind direction wander. Breaks directional monotony."
					},
					"Translation": {
						"Text": "風向き自体の揺らぎの円錐半角。向きの単調さを消す"
					},
					"Key": "KawaiiPhysics_ExternalForce_ProceduralWind:DirectionNoiseAngle"
				},
				{
					"Source": {
						"Text": "風方向。内部で正規化するため非正規化でも可 / Wind direction. Non-normalized values are allowed because this is normalized internally."
					},
					"Translation": {
						"Text": "風方向。内部で正規化するため非正規化でも可"
					},
					"Key": "KawaiiProceduralWindDynamicParams:WindDirection"
				}
			]
		}
	]
}